In [28]:
import seaborn as sns
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [5]:
df = sns.load_dataset('tips')

In [6]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [7]:
df.groupby('time')['total_bill'].mean()

time
Lunch     17.168676
Dinner    20.797159
Name: total_bill, dtype: float64

In [8]:
df.groupby('time')['total_bill'].mean().to_frame('AVG bill')

         AVG bill
time
Lunch   17.168676
Dinner  20.797159

In [9]:
df.groupby('time')['total_bill'].mean().to_frame('AVG bill').reset_index()

     time   AVG bill
0   Lunch  17.168676
1  Dinner  20.797159

In [10]:
df.groupby('time')['total_bill'].mean().to_frame('AVG bill').reset_index().sort_values('AVG bill', ascending=False)

     time   AVG bill
1  Dinner  20.797159
0   Lunch  17.168676

### find the average tip for each night of the week

In [11]:
df.groupby('day')['tip'].mean().to_frame('AVG tip').reset_index()

    day   AVG tip
0  Thur  2.771452
1   Fri  2.734737
2   Sat  2.993103
3   Sun  3.255132

In [12]:
df.day.unique()

['Sun', 'Sat', 'Thur', 'Fri']
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

### find the max tip for each sex

In [13]:
df.groupby('sex')['tip'].max()

sex
Male      10.0
Female     6.5
Name: tip, dtype: float64

### quantile------>> find top 10% of tips every night

In [17]:
df.groupby('day')['tip'].quantile(.9)

day
Thur    4.920
Fri     4.060
Sat     4.802
Sun     5.035
Name: tip, dtype: float64

In [30]:
df.groupby('day')['tip'].agg(minimum = min ,median =np.median, maximum= max)

      minimum  median  maximum
day
Thur     1.25   2.305     6.70
Fri      1.00   3.000     4.73
Sat      1.00   2.750    10.00
Sun      1.01   3.150     6.50

In [31]:
df.groupby('day')['tip'].describe()

      count      mean       std   min     25%    50%     75%    max
day
Thur   62.0  2.771452  1.240223  1.25  2.0000  2.305  3.3625   6.70
Fri    19.0  2.734737  1.019577  1.00  1.9600  3.000  3.3650   4.73
Sat    87.0  2.993103  1.631014  1.00  2.0000  2.750  3.3700  10.00
Sun    76.0  3.255132  1.234880  1.01  2.0375  3.150  4.0000   6.50

### multiple columns in both groupby and as actual plotted columns in the df

In [32]:
df.groupby(['day','time'])[['tip','total_bill']].describe()

              tip                                                        \
            count      mean       std   min     25%   50%    75%    max
day  time
Thur Lunch   61.0  2.767705  1.250162  1.25  2.0000  2.30  3.400   6.70
     Dinner   1.0  3.000000       NaN  3.00  3.0000  3.00  3.000   3.00
Fri  Lunch    7.0  2.382857  0.662966  1.58  1.9600  2.20  2.750   3.48
     Dinner  12.0  2.940000  1.156098  1.00  2.2500  3.00  3.625   4.73
Sat  Dinner  87.0  2.993103  1.631014  1.00  2.0000  2.75  3.370  10.00
Sun  Dinner  76.0  3.255132  1.234880  1.01  2.0375  3.15  4.000   6.50

            total_bill                                                        \
                 count       mean       std    min      25%     50%      75%
day  time
Thur Lunch        61.0  17.664754  7.950334   7.51  12.4300  16.000  20.2700
     Dinner        1.0  18.780000       NaN  18.78  18.7800  18.780  18.7800
Fri  Lunch         7.0  12.845714  2.842228   8.58  11.1250  13.420  14.7000
     Dinner       12.0  19.663333  9.471753   5.75  12.3525  18.665  23.8825
Sat  Dinner       87.0  20.441379  9.480419   3.07  13.9050  18.240  24.7400
Sun  Dinner       76.0  21.410000  8.832122   7.25  14.9875  19.630  25.5975


               max
day  time
Thur Lunch   43.11
     Dinner  18.78
Fri  Lunch   16.27
     Dinner  40.17
Sat  Dinner  50.81
Sun  Dinner  48.17